//==================================================================
//												Object.h
//	全ての元となるオブジェクトテンプレート
//
//==================================================================
//	author :	AT12A 05 宇佐美晃之
//==================================================================
//	開発履歴
//
//	2020/12/22	オブジェクトテンプレートクラス作成
//
//===================================================================

#pragma once

//====== インクルード部 ======
#include "IObject.h"


//===== マクロ定義 =====


//===== クラス定義 =====
namespace ECS
{
	template <class T>
	class Object : public IObject
	{
	public:
		// 自身のweakポインタ
		std::weak_ptr<T> m_self;

	public:
		// コンストラクタ
		Object(){}
		// デストラクタ
		virtual ~Object(){}
	};
}
